[
  {
    "id": "numbers",
    "title": "Numbers & Counting",
    "content": "<p>Numbers are the basic foundation of mathematics. In this lesson, pupils will learn how to count, recognize, and write numbers from 1 to 20. Counting is the act of saying numbers in their correct order, while recognition means identifying the symbols for each number (1, 2, 3, etc.). Pupils are encouraged to use fingers, sticks, bottle tops, and objects around them for practice. Teachers should also introduce number songs and rhymes to make counting fun. Writing numbers can begin by tracing dotted patterns on paper or in sand with a stick. This helps children improve their motor skills and understanding. Counting forward and backward develops fluency and prepares them for addition and subtraction later.</p>",
    "examples": [
      "Count 10 bottle tops 🟢",
      "Trace and write numbers 1–10",
      "Say the numbers from 1 to 20 aloud"
    ],
    "takehome": "Practice counting objects at home such as spoons, chairs, or fruits. Try to identify the numbers on house doors, buses, or calendars.",
    "exercises": [
      "Write numbers 1 to 20 in your book.",
      "Draw 5 balls ⚽ and count them.",
      "Circle the bigger number: 3 or 7?"
    ],
    "image": "images/numbers-chart.png"
  },
  {
    "id": "addition",
    "title": "Simple Addition",
    "content": "<p>Addition means putting two or more groups of things together to find out how many they are in total. It is one of the first operations children learn in arithmetic. For example, if a child has 2 apples and is given 3 more, they now have 5 apples altogether. Using real objects like pencils, toys, or fruits helps children understand addition practically. Teachers can also use number lines where pupils jump forward to add. Pupils should practice with small numbers first, then progress to bigger ones. This topic builds the foundation for multiplication and more complex calculations later in school. Repetition and real-life examples make learning addition easier and enjoyable.</p>",
    "examples": [
      "2 pencils ✏️ + 1 pencil ✏️ = 3 pencils",
      "4 oranges 🍊 + 2 oranges 🍊 = 6 oranges",
      "1 + 5 = 6"
    ],
    "takehome": "Whenever you receive more items at home (like sweets or biscuits), try to count how many you had before and how many you have now. That is addition!",
    "exercises": [
      "Add: 2 + 3 = ?",
      "Add: 5 + 4 = ?",
      "Mama gave you 3 sweets and Papa gave you 2. How many sweets in total?"
    ],
    "image": "images/addition-example.png"
  },
  {
    "id": "subtraction",
    "title": "Simple Subtraction",
    "content": "<p>Subtraction means taking away from a group of things. It helps us find out how many are left after removing some items. For example, if you have 5 candies and you eat 2, you will have 3 left. Subtraction is the opposite of addition. Teachers can use practical objects like toys, fruits, and bottle tops to demonstrate subtraction. Number lines can also be used, where pupils count backwards. Subtraction is important in daily life because it helps us know what remains after spending, eating, or sharing items. Practicing with fun games like 'take away' with toys makes the learning process exciting for children.</p>",
    "examples": [
      "5 – 2 = 3",
      "7 – 4 = 3",
      "10 mangoes 🥭 – 6 = 4 mangoes"
    ],
    "takehome": "At home, share fruits or snacks with your siblings and count how many you have left. That is subtraction in real life.",
    "exercises": [
      "Subtract: 6 – 2 = ?",
      "Subtract: 8 – 5 = ?",
      "Ali had 7 balls and gave 3 to his friend. How many are left?"
    ],
    "image": "images/subtraction-example.png"
  }
]
