{
  "subject": "Mathematics",
  "year": "Year1",
  "topics": [
    {
      "id": 1,
      "title": "Counting Numbers 1–20",
      "content": {
        "explanation": "Counting is the process of saying numbers in order. In Year 1, we begin by learning numbers from 1 to 20. Each number represents a quantity. For example, if you have 5 oranges, you can count them one by one: 1, 2, 3, 4, 5.",
        "examples": "Example: Count the pencils on your desk. If there are 7 pencils, you say: 1, 2, 3, 4, 5, 6, 7.",
        "exercises": "1) Count the books in your school bag.\n2) Write numbers 1 to 20 in your notebook.",
        "selfPractice": "At home, count spoons, cups, or shoes and record the number. Try counting forward and backward from 1–20."
      }
    },
    {
      "id": 2,
      "title": "Addition within 10",
      "content": {
        "explanation": "Addition means putting numbers together. If you join 2 apples and 3 apples, you have 5 apples in total. We use the + sign for addition.",
        "examples": "2 + 3 = 5; 4 + 1 = 5",
        "exercises": "1) 5 + 2 = ?\n2) 3 + 4 = ?",
        "selfPractice": "Take 5 stones, then add 2 more. Count them all. Practice writing your answers in your notebook."
      }
    },
    {
      "id": 3,
      "title": "Subtraction within 10",
      "content": {
        "explanation": "Subtraction means taking away. If you have 5 bananas and eat 2, you have 3 left. We use the − sign for subtraction.",
        "examples": "5 − 2 = 3; 6 − 1 = 5",
        "exercises": "1) 7 − 3 = ?\n2) 8 − 2 = ?",
        "selfPractice": "Use your toys: Take 6 toys, remove 2. Count what is left."
      }
    },
    {
      "id": 4,
      "title": "Shapes (Circle, Square, Triangle, Rectangle)",
      "content": {
        "explanation": "Shapes are things we see every day. A circle is round like a ball. A square has 4 equal sides. A triangle has 3 sides. A rectangle has 2 long sides and 2 short sides.",
        "examples": "Examples: The sun is a circle, a book is a rectangle, a slice of bread can be square.",
        "exercises": "1) Draw a circle and a triangle in your notebook.\n2) Find 3 objects in your home shaped like rectangles.",
        "selfPractice": "Walk around your home and list 5 objects and their shapes."
      }
    },
    {
      "id": 5,
      "title": "Comparing Numbers",
      "content": {
        "explanation": "We compare numbers to see which is bigger or smaller. We use signs like > (greater than), < (less than), and = (equal to).",
        "examples": "5 > 3 means 5 is greater than 3; 2 < 7 means 2 is less than 7.",
        "exercises": "1) Compare: 8 and 5\n2) Compare: 4 and 9",
        "selfPractice": "Compare numbers from your class attendance. Who has more books: you or your friend?"
      }
    },
    {
      "id": 6,
      "title": "Ordinal Numbers (1st–10th)",
      "content": {
        "explanation": "Ordinal numbers tell position or order. If you stand in a line, the first person is 1st, the second person is 2nd, and so on.",
        "examples": "In a race, the child who finishes before everyone is 1st.",
        "exercises": "1) Who is 3rd in your class row?\n2) Write the ordinal numbers for 1 to 10.",
        "selfPractice": "Arrange 5 toys in a line and label them 1st, 2nd, 3rd, etc."
      }
    },
    {
      "id": 7,
      "title": "Telling Time (Hours only)",
      "content": {
        "explanation": "A clock tells us time. In Year 1, we learn the hour hand (short hand). If the hand points to 3, it is 3 o’clock.",
        "examples": "When the short hand is on 7, we say 7 o’clock.",
        "exercises": "1) Draw a clock showing 5 o’clock.\n2) What time do you eat lunch?",
        "selfPractice": "Check the clock at home and write down 3 different o’clock times."
      }
    },
    {
      "id": 8,
      "title": "Money (₦1, ₦5, ₦10)",
      "content": {
        "explanation": "Money helps us buy things. In Nigeria, our money is called Naira (₦). The smallest notes we learn are ₦1, ₦5, ₦10.",
        "examples": "If you buy sweets for ₦5 and biscuits for ₦10, you spend ₦15.",
        "exercises": "1) You have ₦10, you spend ₦4. How much is left?\n2) If you have ₦5 and ₦10, how much do you have?",
        "selfPractice": "Ask your parents to show you small notes and coins. Try adding them together."
      }
    },
    {
      "id": 9,
      "title": "Measurement (Length – long/short)",
      "content": {
        "explanation": "Measurement tells us how big or small something is. In Year 1, we compare objects to see which is longer or shorter.",
        "examples": "A pencil is longer than a sharpener.",
        "exercises": "1) Compare your book and your ruler. Which is longer?\n2) Is your shoe longer than your pen?",
        "selfPractice": "At home, compare 3 items and write which is long and which is short."
      }
    },
    {
      "id": 10,
      "title": "Word Problems (Simple Addition/Subtraction)",
      "content": {
        "explanation": "Word problems are real-life questions. You must read, think, and solve. Look for words like ‘altogether’ (addition) or ‘left’ (subtraction).",
        "examples": "Ali has 3 mangoes. His sister gives him 2 more. How many does he have? (3 + 2 = 5)",
        "exercises": "1) Bola has 6 sweets. She eats 2. How many are left?\n2) A boy has 4 pencils, his father buys him 3 more. How many pencils in total?",
        "selfPractice": "Create your own story sum and solve it."
      }
    }
  ]
}
